class FoodDetail {
  String id;
  String image;
  String name;
  double price;
  double rate;
  String kcal;
  String cookingTime;
  String description;

  FoodDetail({
    required this.id,
    required this.image,
    required this.name,
    required this.price,
    required this.rate,
    required this.kcal,
    required this.cookingTime,
    required this.description,
  });
}

List<FoodDetail> foodsItems = [
  FoodDetail(
    id: '1',
    image: 'assets/alma.jpeg',
    name: 'Алма',
    price: 80,
    rate: 4.5,
    kcal: '100',
    cookingTime: '20min',
    description: '''
Алма тууралуу кыскача маалымат:

Тарыхы: Алманын мекени Борбордук Азия, тагыраак айтканда Казакстандагы Тянь-Шань тоолору.
Түрлөрү: Жүздөгөн түрлөрү бар. Белгилүү сорттору: "Голден Делишес", "Грэнни Смит", "Фуджи", "Гала".
Ден соолукка пайдасы: Витаминдерге, минералдарга жана антиоксиданттарга бай. Жүрөк-кан тамыр ооруларын, диабетти жана ашказан ооруларын алдын алат.
Өндүрүш: Эң көп алма өндүргөн өлкөлөр: Кытай, АКШ, Польша, Индия, Иран.
Тандоо жана сактоо: Жаңы алмаларды жылмакай, түстүү жана таксыз тандоо керек. Муздаткычта сактоо сунушталат.''',
  ),
  FoodDetail(
    id: '2',
    image: 'assets/anar.jpeg',
    name: 'Анар',
    price: 120,
    rate: 5.0,
    kcal: '100',
    cookingTime: '30min',
    description: '''Анар тууралуу кыскача маалымат:

Анар тууралуу кызыктуу фактылар
Тарыхы жана таралышы: Анар байыркы мезгилден бери Жакынкы Чыгышта жана Жер Ортолук деңиз аймагында өстүрүлүп келет. Алгачкы жолу Иранда жана Индияда өстүрүлгөн деп эсептелет.
Түрлөрү: Анарлардын ар кандай сорттору бар, алардын ичинен эң белгилүүлөрүнө "Вандерфул", "Гренада" жана "Ангел Ред" кирет.
Ден соолукка пайдасы: Анар антиоксиданттарга, витамин Сге, клетчаткага жана башка пайдалуу заттарга бай. Алар жүрөк-кан тамыр ооруларына, рак оорусуна жана сезгенүү процесстерине каршы күрөшүүгө жардам берет.
Айыл чарба жана өндүрүш: Дүйнө жүзү боюнча эң көп анар өндүргөн өлкөлөргө Иран, Индия, Кытай, Түркия жана Египет кирет.''',
  ),
  FoodDetail(
    id: '3',
    image: 'assets/balgaricki.jpeg',
    name: 'Балгарский',
    price: 30,
    rate: 4.6,
    kcal: '20',
    cookingTime: '15min',
    description: '''Болгар калемпири (камби)
Тарых жана өтмөктөр
Тарыхы жана таралышы: болгар калемпири Борбордук жана Түштүк Америкадан келип чыккан. Жаңы Дүйнө ачылгандан кийин ал Европага жана дүйнөнүн башка бөлүктөрүнө тез тарады.
Түрлөрү: Болгариянын ар кандай түрлөрү барппер, түсү, формасы жана даамы боюнча вариант. Негизги түс түстөрү жашыл, кызыл, сары жана кызгылт сары. Кызыл калемпир-эң таттуу жашыл-ачуу.''',
  ),
  FoodDetail(
    id: '4',
    image: 'assets/pamidor.jpeg',
    name: 'Памидор',
    price: 130,
    rate: 5.0,
    kcal: '160',
    cookingTime: '08min',
    description: '''Помидор (Помидор)
Тарыхы жана келип чыгышы
Тарыхы жана таралышы: помидор Түштүк Америкадан, атап айтканда азыркы Перу менен Эквадордун аймактарынан келет. Испан изилдөөчүлөрү аларды 16-кылымда Европага алып келишкен, алар тез популярдуулукка жетишкен.
Түрлөрү: помидордун формасы, түсү жана көлөмү боюнча ар кандай сорттору бар. Эң популярдуу сорттордун катарына "алча", "Рома", "Биг Биф"жана" Брендивайн " кирет.''',
  ),
  FoodDetail(
    id: '5',
    image: 'assets/alcha.jpeg',
    name: 'Алча',
    price: 150,
    rate: 4.8,
    kcal: '100',
    cookingTime: '05min',
    description: '''Алча (жапайы өрүк)
Тарыхы жана келип чыгышы
Тарыхы жана таралышы: ач көздүк Кавказ жана Кичи Азия аймактарында пайда болгон. Ал Европада жана Азияда таралган жана кичинекей кычкыл жемиштери менен белгилүү.
Түрлөрү: алчанын түсү жана даамы боюнча ар кандай сорттору бар. Эң кеңири тарагандары сары, кызыл жана кызгылт көк.''',
  ),
  FoodDetail(
    id: '5',
    image: 'assets/banan.jpeg',
    name: 'Банан',
    price: 75,
    rate: 5.0,
    kcal: '10',
    cookingTime: 'Ready',
    description: '''Банандар
Тарыхы жана келип чыгышы
Тарыхы жана таралышы: банан Түштүк-Чыгыш Азиядан, айрыкча азыркы Малайзия менен Индонезиянын аймактарынан келип чыккан. Алар Африкага жана Түштүк Америкага соода жана миграция аркылуу киргизилген. Бүгүнкү күндө банан дүйнөдөгү эң популярдуу жемиштердин катарына кирет.
Түрлөрү: банандын ар кандай түрлөрү бар, алардын эң популярдуусу десерт банандары жана плантациялар. Десерт банандары таттуу жана жумшак, ал эми плантациялар катуураак жана көбүнчө тамак бышыруу үчүн колдонулат.''',
  ),
];
